[DataFrame에서 데이터 다루기]

[1] 모듈 로딩 및 데이터 준비 <hr>

In [129]:
# [1-1]모듈 로딩
import pandas as pd     # 데이터 분석 및 전처리 관련 모듈
import numpy as np      # NaN/NAN/nan 즉, 빈칸 표시 관련 모듈 
                        # 배열(array)를 파이썬 구현한 모듈

In [130]:
# [1-2] 데이터 준비
DATA_FILE = '../DATA/member3.csv'

In [131]:
# [2-1] CSV_FILE => DataFrame 로딩 

memberDF  = pd.read_csv(DATA_FILE,
                        sep=";", 
                        header=None, 
                        names= ['번호','이름','나이','지역'],
                        index_col=1)

memberDF

       번호    나이   지역
이름
홍길동     1  20.0   대구
이나영     2  12.0   서울
최희진     3   NaN   마산
마징가     4  31.0   부산
장원영     5  17.0   대구
김나나     6  25.0   서울
박서희     7  33.0  NaN
베트맨     8  30.0   미국
스파이더맨   9   NaN   서울
원더우먼   10  33.0   포항

In [132]:
# [2-2] 데이터확인
memberDF.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 홍길동 to 원더우먼
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      10 non-null     int64
 1   나이      8 non-null      float64
 2   지역      9 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 320.0+ bytes

In [133]:
memberDF.describe(include='all')

              번호         나이   지역
count   10.00000   8.000000    9
unique       NaN        NaN    6
top          NaN        NaN   서울
freq         NaN        NaN    3
mean     5.50000  25.125000  NaN
std      3.02765   7.989949  NaN
min      1.00000  12.000000  NaN
25%      3.25000  19.250000  NaN
50%      5.50000  27.500000  NaN
75%      7.75000  31.500000  NaN
max     10.00000  33.000000  NaN

[3] 데이터 다루기 <hr>

In [134]:
# 현재 데이터

memberDF

       번호    나이   지역
이름
홍길동     1  20.0   대구
이나영     2  12.0   서울
최희진     3   NaN   마산
마징가     4  31.0   부산
장원영     5  17.0   대구
김나나     6  25.0   서울
박서희     7  33.0  NaN
베트맨     8  30.0   미국
스파이더맨   9   NaN   서울
원더우먼   10  33.0   포항

In [135]:
# 컬럼별/행별 데이터/ 값 개수
print(memberDF.count(axis=1))
print(memberDF.count(axis=0))

이름
홍길동      3
이나영      3
최희진      2
마징가      3
장원영      3
김나나      3
박서희      2
베트맨      3
스파이더맨    2
원더우먼     3
dtype: int64
번호    10
나이     8
지역     9
dtype: int64

In [136]:
# 고유값 & 고유값별 데이터 갯수
for col in memberDF.columns:
    print(f"{col}번호 컬럼 : {memberDF[col].unique()}")
    print(f"고유값 데이터 갯수 :{memberDF[col].value_counts(dropna=False)}")

번호번호 컬럼 : [ 1  2  3  4  5  6  7  8  9 10]
고유값 데이터 갯수 :번호
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
Name: count, dtype: int64
나이번호 컬럼 : [20. 12. nan 31. 17. 25. 33. 30.]
고유값 데이터 갯수 :나이
NaN     2
33.0    2
12.0    1
20.0    1
31.0    1
17.0    1
25.0    1
30.0    1
Name: count, dtype: int64
지역번호 컬럼 : ['대구' '서울' '마산' '부산' nan '미국' '포항']
고유값 데이터 갯수 :지역
서울     3
대구     2
마산     1
부산     1
NaN    1
미국     1
포항     1
Name: count, dtype: int64

In [137]:
memberDF.describe()

             번호         나이
count  10.00000   8.000000
mean    5.50000  25.125000
std     3.02765   7.989949
min     1.00000  12.000000
25%     3.25000  19.250000
50%     5.50000  27.500000
75%     7.75000  31.500000
max    10.00000  33.000000

In [138]:
## 다양한 통계치 계산 => 결측치는 제외하고 계산
memberDF.mean(numeric_only=True, skipna= False)

번호    5.5
나이    NaN
dtype: float64

In [139]:
memberDF['나이'].mean()

np.float64(25.125)

In [140]:
# 모든 컬럼별 통계치 계산 후 출력
# object 타입의 컬럼 제외
for col in memberDF.columns[:-1]:
    print(f'[{col}] 컬럼 통계치')
    print(f'평균 {memberDF[col].mean()}')
    print(f'최솟값 {memberDF[col].min()}')
    print(f'최댓값 {memberDF[col].max()}')
    print(f'표준편차 {memberDF[col].std()}')
    print(f'중앙값 {memberDF[col].median()}')
    print(f'최빈값 {memberDF[col].mode()}')

[번호] 컬럼 통계치
평균 5.5
최솟값 1
최댓값 10
표준편차 3.0276503540974917
중앙값 5.5
최빈값 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: 번호, dtype: int64
[나이] 컬럼 통계치
평균 25.125
최솟값 12.0
최댓값 33.0
표준편차 7.9899490432846765
중앙값 27.5
최빈값 0    33.0
Name: 나이, dtype: float64

In [141]:
# 컬럼과 컬럼의 관계
memberDF.corr(numeric_only=True)

          번호        나이
번호  1.000000  0.731725
나이  0.731725  1.000000